/****************************************************************************
* 文 件 名: main.c
* 描    述: 以外部中断方式在按键KEY1控制LED1.LED2.LED3实现倒流水灯效果和LED1闪烁效果之间切换
****************************************************************************/
#include <ioCC2530.h>

typedef unsigned char uchar;
typedef unsigned int  uint;

#define LED1 P0_5       //定义P0.5口为LED1控制端
#define LED2 P0_6       //定义P0.6口为LED2控制端
#define LED3 P0_7       //定义P0.7口为LED3控制端

#define KEY1 P0_4       // P0.4口控制KEY1
#define KEY2 P1_2       // P1.2口控制KEY2

#define ON      1
#define OFF     0

uchar Key1Value = 0;     //记录KEY1的值
uchar Key2Value = 0;     //记录KEY2的值

/****************************************************************************
* 名    称: DelayMS()
* 功    能: 以毫秒为单位延时，系统时钟不配置时默认为16M(用示波器测量相当精确)
* 入口参数: msec 延时参数，值越大，延时越久
* 出口参数: 无
****************************************************************************/
void DelayMS(uint msec)
{ 
    uint i,j;
    static int DelayCallCount=0;
    
    for (i=0; i<msec; i++)
        for (j=0; j<535; j++);
            DelayCallCount++;
            
    while(Key2Value);
}

void Delay(uint msec)
{ 
    uint i,j;
    static int DelayCallCount=0;
    
    for (i=0; i<msec; i++)
        for (j=0; j<535; j++);
            DelayCallCount++;
}

/****************************************************************************
* 名    称: LedOnOrOff()
* 功    能: 点亮或熄灭所有LED灯    
* 入口参数: mode为1时LED灯亮  mode为0时LED灯灭
* 出口参数: 无
****************************************************************************/
void LedOnOrOff(uchar mode)
{
    LED1 = mode;
    LED2 = mode;
    LED3 = mode;
}

/****************************************************************************
* 名    称: InitLed()
* 功    能: 设置LED灯相应的IO口
* 入口参数: 无
* 出口参数: 无
****************************************************************************/
void InitLed(void)
{

  P0DIR |= 0x20;               //P1.4定义为输出口  
  P0DIR |= 0x40;               //P1.5定义为输出口 
  P0DIR |= 0x80;               //P1.6定义为输出口 

  LedOnOrOff(0);               //使所有LED灯默认为熄灭状态
}

/****************************************************************************
* 名    称: InitKey()
* 功    能: 设置KEY相应的IO口，采用中断方式 
* 入口参数: 无
* 出口参数: 无
****************************************************************************/
void InitKey()
{  
  //初始按键1的中断和输入配置
  P0SEL &= ~0x10;     //设置P0.4为普通IO口  
  P0DIR &= ~0x10;     //按键接在P0.4口上，设P0.4为输入模式 
  P0INP &= ~0x10;     //打开P0.4上拉电阻 

  IEN1 |= 0x20;   // 允许P0口中断;  
  P0IEN |= 0x10;  // P0.4 设置为中断方式 
  PICTL |= 0x01; // 下降沿触发  
  P0IFG = 0x00;   // 初始化中断标志位

  //初始按键2的中断和输入配置
  P1SEL &= ~0x04;     //设置P1.2为普通IO口  
  P1DIR &= ~0x04;     //按键接在P1.2口上，设P1.2为输入模式 
  P1INP &= ~0x04;     //打开P1.2上拉电阻 
  
  IEN2 |= 0x10;   // 允许P0口中断 为什么要让所有的中断都可以中断？    
  P1IEN |= 0x04;  // P1.2 设置为中断方式 
  PICTL |= 0x02; // 下降沿触发  
  P0IFG = 0x00;   // 初始化中断标志位

  EA = 1; 
}

/****************************************************************************
* 名    称: P0_ISR(void) 中断处理函数 
* 描    述: #pragma vector = 中断向量，紧接着是中断处理程序
****************************************************************************/
#pragma vector = P0INT_VECTOR    
__interrupt void P0_ISR(void) 
{ 
    if( P0IFG & 0x10 )          //按键P0.4中断
    {
      Delay(10);       //延时去抖     
       if(P0_4==0)       
       {
           Key2Value = 0;
           Key1Value = !Key1Value;  //产生中断保存中断状态
       }  
    } 
    
    P0IFG &= ~ 0x10;             //清Pin中断标志
    P0IF = 0;              //清端口0中断标志
} 

/****************************************************************************
* 名    称: P1_ISR(void) 中断处理函数 
* 描    述: #pragma vector = 中断向量，紧接着是中断处理程序
****************************************************************************/
#pragma vector = P1INT_VECTOR    
__interrupt void P1_ISR(void) 
{ 
    if( P1IFG & 0x04 )          //按键P1.2中断
    {
      Delay(10);       //延时去抖     
       if(P1_2 == 0)       
       {
           Key2Value = !Key2Value;  //产生中断保存中断状态
       }  
    } 
    
    P1IFG &= ~ 0x04;             //清Pin中断标志
    P1IF = 0;                    //清端口1中断标志
} 

/****************************************************************************
* 程序入口函数
****************************************************************************/
void main(void)
{
    InitLed();             //设置LED灯相应的IO口
    InitKey();             //设置KEY相应的IO口
    
    while(1)
    {
        if(Key1Value == 1)   //切换到LED3、LED2、LED1将倒序流水灯闪烁 
        {  
            LED3 = !LED3;         
            DelayMS(200); 
            LED2 = !LED2;         
            DelayMS(200);            
            LED1 = !LED1;         
            DelayMS(200);
        }
        else // 切换到LED1闪烁效果
        {
            LedOnOrOff(0);
            LED1 = ON;    //点亮LED1      
            DelayMS(500); 
            LED1 = OFF;   //熄灭LED1 
            DelayMS(500);           
        
        }
    }
}
